/* ==================================================================   
 * Created [2006-12-28] by Jon.King 
 * ==================================================================  
 * TSS 
 * ================================================================== 
 * mailTo:jinpujun@gmail.com
 * Copyright (c) Jon.King, 2015-2018  
 * ================================================================== 
 */
package com.boubei.tss.cache;

/**
 * <pre>
 * 对象可重复使用接口。
 * 
 * 在其实现类中需要实现接口中定义的recycle()方法，实现如何回收利用对象。
 * </pre>
 */
public interface Reusable {

	/**
	 * 当对象使用完毕后，设置其状态，使得它可以重新被使用。
	 * 
	 * @throws 如果不能recycle该对象则抛异常
	 */
	public void recycle() throws Exception;

}
